[
    {
        "title": "Misinformation Detection AI",
        "summary": "I scraped Twitter for over 1200 tweets regarding controversial topics that potentially contain misinformation or trolling, labeled them as misinformation and/or trolling with a team of coders, and created a codebook to keep our standards of coding consistent. In collaboration with Dr. Liu and Dr. Jazaieri, as well as students majoring in psychology, business, and computer science, I worked to construct training datasets for machine learning models.",
        "link": "https://www.linkedin.com/in/yuhong-liu-02537b22/",
        "image": "data/images/misinfo.jpg"
    },
    {
        "title": "AR/VR Research and Development",
        "summary": "I collaborated with Dr. Lukoff and a senior design team to create a digital twin of university dorms using virtual reality. Guiding our work using Agile Scrum methodology, we implemented Matterport SDK with Javascript to make 10 3D virtual scans available to prospective students. I presented the project to the Matterport Executive Board and answered their questions, effectively establishing a relationship between Matterport and SCU.",
        "link": "https://scudormtours.vercel.app/",
        "image": "data/images/dorms.jpg"
    },
    {
        "title": "Bellwether Classification Models",
        "summary": "In 2021, I led a team of 6 ambitious researchers under Dr. Mui to study the statistical significance of bellwether counties in US presidential elections from 2000-2022. Bellwether counties are counties that have consistently voted in favor of the winning presidential candidate every election cycle. Since only one bellwether remains, our group trained 3 machine learning classifiers on 531486 county-level data points in order to find out what attributes make bellwethers stand out.",
        "link": "https://static1.squarespace.com/static/5fa95df956e953688e53a817/t/61c23da2a32f1f5cc4e3f592/1640119719012/Seriatim+Journal+Fall+2021.pdf",
        "image": "data/images/map.png"
    },
    {
        "title": "Exoplanet Data Mining",
        "summary": "In one of my first computer science projects, I led 5 other team members in creating the Comprehensive Habitability Index (CHI) for evaluating the eccentricity, habitable zone, and atmospheric similarity of exoplanets to that of Earth. Computing this CHI required extensive planet habitability research, parsing through NASA's exoplanet archive, and using a general understanding of astrophysics and chemistry to mathematically compute various indicators of habitability.",
        "link": "https://drive.google.com/file/d/1H81uODt8P8_l3DuHJvFaUk82Y-yp0mXH/view",
        "image": "data/images/exoplanets.png"
    }
] 